"""
データロガー　TSND151
圧力センサー　FlexiForce＋拡張ケーブル

"""

# ============================
# config
# ============================
target = "20231229-192016"
target = "20231229-191628"
target = "20231229-214134"

# load test
target = "20231229-221905"
target = "20231229-221914"
target = "20231229-221930"
target = "20231229-221945"
target = "20231229-222000"
target = "20231229-222015"
target = "20231229-222029"
target = "20231229-222046"
target = "20231229-223618"
target = "20231229-223744"
target = "20231229-223858"

# ============================
# path
# ============================
# データ格納場所へのパス
root = "C:/Users/boris/Documents"

# ============================
# import
# ============================
from src.scripts.data_controller import merge_data

# ============================
# define
# ============================


# ============================
# run
# ============================
if __name__ == '__main__':
    print("run")
    merge_data(root, target)
